; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	infrared3 - mode
	thermograph2 - mode
	image0 - mode
	infrared1 - mode
	Star0 - direction
	GroundStation2 - direction
	Star1 - direction
	Star3 - direction
	Star4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 image0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared3)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 142)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 infrared3)
	(supports instrument4 image0)
	(calibration_target instrument4 Star0)
	(supports instrument5 infrared3)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 132)
	(supports instrument6 infrared1)
	(supports instrument6 image0)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star1)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet7)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 194)
	(= (data Star3 infrared3) 290)
	(= (data Star4 infrared3) 97)
	(= (data Planet5 infrared3) 161)
	(= (data Phenomenon6 infrared3) 287)
	(= (data Planet7 infrared3) 128)
	(= (data Phenomenon8 infrared3) 294)
	(= (data Planet9 infrared3) 124)
	(= (data Star10 infrared3) 230)
	(= (data Phenomenon11 infrared3) 66)
	(= (data Star12 infrared3) 66)
	(= (data Star3 thermograph2) 247)
	(= (data Star4 thermograph2) 189)
	(= (data Planet5 thermograph2) 35)
	(= (data Phenomenon6 thermograph2) 29)
	(= (data Planet7 thermograph2) 269)
	(= (data Phenomenon8 thermograph2) 49)
	(= (data Planet9 thermograph2) 107)
	(= (data Star10 thermograph2) 223)
	(= (data Phenomenon11 thermograph2) 291)
	(= (data Star12 thermograph2) 227)
	(= (data Star3 image0) 86)
	(= (data Star4 image0) 15)
	(= (data Planet5 image0) 170)
	(= (data Phenomenon6 image0) 123)
	(= (data Planet7 image0) 7)
	(= (data Phenomenon8 image0) 24)
	(= (data Planet9 image0) 192)
	(= (data Star10 image0) 39)
	(= (data Phenomenon11 image0) 144)
	(= (data Star12 image0) 296)
	(= (data Star3 infrared1) 23)
	(= (data Star4 infrared1) 271)
	(= (data Planet5 infrared1) 143)
	(= (data Phenomenon6 infrared1) 5)
	(= (data Planet7 infrared1) 210)
	(= (data Phenomenon8 infrared1) 240)
	(= (data Planet9 infrared1) 232)
	(= (data Star10 infrared1) 277)
	(= (data Phenomenon11 infrared1) 141)
	(= (data Star12 infrared1) 114)
	(= (slew_time GroundStation2 Star0) 39.58)
	(= (slew_time Star0 GroundStation2) 39.58)
	(= (slew_time GroundStation2 Star1) 25.9)
	(= (slew_time Star1 GroundStation2) 25.9)
	(= (slew_time Star1 Star0) 20.09)
	(= (slew_time Star0 Star1) 20.09)
	(= (slew_time Star3 Star0) 19.52)
	(= (slew_time Star0 Star3) 19.52)
	(= (slew_time Star3 Star1) 10.73)
	(= (slew_time Star1 Star3) 10.73)
	(= (slew_time Star3 GroundStation2) 14.41)
	(= (slew_time GroundStation2 Star3) 14.41)
	(= (slew_time Star4 Star0) 1.812)
	(= (slew_time Star0 Star4) 1.812)
	(= (slew_time Star4 Star1) 49.23)
	(= (slew_time Star1 Star4) 49.23)
	(= (slew_time Star4 GroundStation2) 63.22)
	(= (slew_time GroundStation2 Star4) 63.22)
	(= (slew_time Star4 Star3) 25.83)
	(= (slew_time Star3 Star4) 25.83)
	(= (slew_time Planet5 Star0) 2.512)
	(= (slew_time Star0 Planet5) 2.512)
	(= (slew_time Planet5 Star1) 60.86)
	(= (slew_time Star1 Planet5) 60.86)
	(= (slew_time Planet5 GroundStation2) 20.17)
	(= (slew_time GroundStation2 Planet5) 20.17)
	(= (slew_time Planet5 Star3) 7.756)
	(= (slew_time Star3 Planet5) 7.756)
	(= (slew_time Planet5 Star4) 30.61)
	(= (slew_time Star4 Planet5) 30.61)
	(= (slew_time Phenomenon6 Star0) 18.94)
	(= (slew_time Star0 Phenomenon6) 18.94)
	(= (slew_time Phenomenon6 Star1) 12.7)
	(= (slew_time Star1 Phenomenon6) 12.7)
	(= (slew_time Phenomenon6 GroundStation2) 22.2)
	(= (slew_time GroundStation2 Phenomenon6) 22.2)
	(= (slew_time Phenomenon6 Star3) 47.19)
	(= (slew_time Star3 Phenomenon6) 47.19)
	(= (slew_time Phenomenon6 Star4) 30.54)
	(= (slew_time Star4 Phenomenon6) 30.54)
	(= (slew_time Phenomenon6 Planet5) 55.04)
	(= (slew_time Planet5 Phenomenon6) 55.04)
	(= (slew_time Planet7 Star0) 7.757)
	(= (slew_time Star0 Planet7) 7.757)
	(= (slew_time Planet7 Star1) 55.78)
	(= (slew_time Star1 Planet7) 55.78)
	(= (slew_time Planet7 GroundStation2) 4.035)
	(= (slew_time GroundStation2 Planet7) 4.035)
	(= (slew_time Planet7 Star3) 42.42)
	(= (slew_time Star3 Planet7) 42.42)
	(= (slew_time Planet7 Star4) 26.05)
	(= (slew_time Star4 Planet7) 26.05)
	(= (slew_time Planet7 Planet5) 37.07)
	(= (slew_time Planet5 Planet7) 37.07)
	(= (slew_time Planet7 Phenomenon6) 62.95)
	(= (slew_time Phenomenon6 Planet7) 62.95)
	(= (slew_time Phenomenon8 Star0) 41.35)
	(= (slew_time Star0 Phenomenon8) 41.35)
	(= (slew_time Phenomenon8 Star1) 24.76)
	(= (slew_time Star1 Phenomenon8) 24.76)
	(= (slew_time Phenomenon8 GroundStation2) 20.91)
	(= (slew_time GroundStation2 Phenomenon8) 20.91)
	(= (slew_time Phenomenon8 Star3) 5.682)
	(= (slew_time Star3 Phenomenon8) 5.682)
	(= (slew_time Phenomenon8 Star4) 88.97)
	(= (slew_time Star4 Phenomenon8) 88.97)
	(= (slew_time Phenomenon8 Planet5) 79.2)
	(= (slew_time Planet5 Phenomenon8) 79.2)
	(= (slew_time Phenomenon8 Phenomenon6) 46.72)
	(= (slew_time Phenomenon6 Phenomenon8) 46.72)
	(= (slew_time Phenomenon8 Planet7) 43.18)
	(= (slew_time Planet7 Phenomenon8) 43.18)
	(= (slew_time Planet9 Star0) 21.54)
	(= (slew_time Star0 Planet9) 21.54)
	(= (slew_time Planet9 Star1) 51.25)
	(= (slew_time Star1 Planet9) 51.25)
	(= (slew_time Planet9 GroundStation2) 51.44)
	(= (slew_time GroundStation2 Planet9) 51.44)
	(= (slew_time Planet9 Star3) 11.94)
	(= (slew_time Star3 Planet9) 11.94)
	(= (slew_time Planet9 Star4) 51.76)
	(= (slew_time Star4 Planet9) 51.76)
	(= (slew_time Planet9 Planet5) 3.339)
	(= (slew_time Planet5 Planet9) 3.339)
	(= (slew_time Planet9 Phenomenon6) 23.17)
	(= (slew_time Phenomenon6 Planet9) 23.17)
	(= (slew_time Planet9 Planet7) 7.412)
	(= (slew_time Planet7 Planet9) 7.412)
	(= (slew_time Planet9 Phenomenon8) 22.46)
	(= (slew_time Phenomenon8 Planet9) 22.46)
	(= (slew_time Star10 Star0) 15.32)
	(= (slew_time Star0 Star10) 15.32)
	(= (slew_time Star10 Star1) 23.23)
	(= (slew_time Star1 Star10) 23.23)
	(= (slew_time Star10 GroundStation2) 11.81)
	(= (slew_time GroundStation2 Star10) 11.81)
	(= (slew_time Star10 Star3) 71.51)
	(= (slew_time Star3 Star10) 71.51)
	(= (slew_time Star10 Star4) 66.01)
	(= (slew_time Star4 Star10) 66.01)
	(= (slew_time Star10 Planet5) 62.31)
	(= (slew_time Planet5 Star10) 62.31)
	(= (slew_time Star10 Phenomenon6) 90.03)
	(= (slew_time Phenomenon6 Star10) 90.03)
	(= (slew_time Star10 Planet7) 33.12)
	(= (slew_time Planet7 Star10) 33.12)
	(= (slew_time Star10 Phenomenon8) 37.88)
	(= (slew_time Phenomenon8 Star10) 37.88)
	(= (slew_time Star10 Planet9) 22.33)
	(= (slew_time Planet9 Star10) 22.33)
	(= (slew_time Phenomenon11 Star0) 59.68)
	(= (slew_time Star0 Phenomenon11) 59.68)
	(= (slew_time Phenomenon11 Star1) 79.71)
	(= (slew_time Star1 Phenomenon11) 79.71)
	(= (slew_time Phenomenon11 GroundStation2) 14.36)
	(= (slew_time GroundStation2 Phenomenon11) 14.36)
	(= (slew_time Phenomenon11 Star3) 52.42)
	(= (slew_time Star3 Phenomenon11) 52.42)
	(= (slew_time Phenomenon11 Star4) 52.29)
	(= (slew_time Star4 Phenomenon11) 52.29)
	(= (slew_time Phenomenon11 Planet5) 57.99)
	(= (slew_time Planet5 Phenomenon11) 57.99)
	(= (slew_time Phenomenon11 Phenomenon6) 39.15)
	(= (slew_time Phenomenon6 Phenomenon11) 39.15)
	(= (slew_time Phenomenon11 Planet7) 27.64)
	(= (slew_time Planet7 Phenomenon11) 27.64)
	(= (slew_time Phenomenon11 Phenomenon8) 30.85)
	(= (slew_time Phenomenon8 Phenomenon11) 30.85)
	(= (slew_time Phenomenon11 Planet9) 37.56)
	(= (slew_time Planet9 Phenomenon11) 37.56)
	(= (slew_time Phenomenon11 Star10) 17.04)
	(= (slew_time Star10 Phenomenon11) 17.04)
	(= (slew_time Star12 Star0) 42.78)
	(= (slew_time Star0 Star12) 42.78)
	(= (slew_time Star12 Star1) 9.31)
	(= (slew_time Star1 Star12) 9.31)
	(= (slew_time Star12 GroundStation2) 21.12)
	(= (slew_time GroundStation2 Star12) 21.12)
	(= (slew_time Star12 Star3) 74.56)
	(= (slew_time Star3 Star12) 74.56)
	(= (slew_time Star12 Star4) 7.611)
	(= (slew_time Star4 Star12) 7.611)
	(= (slew_time Star12 Planet5) 54.45)
	(= (slew_time Planet5 Star12) 54.45)
	(= (slew_time Star12 Phenomenon6) 45.14)
	(= (slew_time Phenomenon6 Star12) 45.14)
	(= (slew_time Star12 Planet7) 70.68)
	(= (slew_time Planet7 Star12) 70.68)
	(= (slew_time Star12 Phenomenon8) 33.83)
	(= (slew_time Phenomenon8 Star12) 33.83)
	(= (slew_time Star12 Planet9) 43.25)
	(= (slew_time Planet9 Star12) 43.25)
	(= (slew_time Star12 Star10) 29.73)
	(= (slew_time Star10 Star12) 29.73)
	(= (slew_time Star12 Phenomenon11) 18.97)
	(= (slew_time Phenomenon11 Star12) 18.97)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Star3 infrared1)
	(have_image Star4 infrared3)
	(have_image Planet5 infrared1)
	(have_image Phenomenon6 image0)
	(have_image Planet7 image0)
	(have_image Phenomenon8 infrared1)
	(have_image Planet9 infrared1)
	(have_image Phenomenon11 thermograph2)
	(have_image Star12 infrared1)
))
(:metric minimize (fuel-used))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
2. (turn_to satellite0 planet9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet9)
   changed: (fuel satellite0) from 142 to 120.46, (fuel-used) from 0 to 21.54
   goals met: 0 of 9
3. (turn_to satellite1 phenomenon6 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon6)
   changed: (fuel satellite1) from 132 to 113.06, (fuel-used) from 21.54 to 40.48
   goals met: 0 of 9
4. (turn_to satellite0 star0 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 120.46 to 98.92, (fuel-used) from 40.48 to 62.02
   goals met: 0 of 9
5. (turn_to satellite0 planet9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet9)
   changed: (fuel satellite0) from 98.92 to 77.38, (fuel-used) from 62.02 to 83.56
   goals met: 0 of 9
6. (turn_to satellite0 star0 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 77.38 to 55.84, (fuel-used) from 83.56 to 105.1
   goals met: 0 of 9
7. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 9
8. (turn_to satellite0 planet9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet9)
   changed: (fuel satellite0) from 55.84 to 34.3, (fuel-used) from 105.1 to 126.64
   goals met: 0 of 9
9. (take_image satellite0 planet9 instrument0 infrared1)
   added: (have_image planet9 infrared1)
   changed: (data_capacity satellite0) from 1000 to 768, (data-stored) from 0 to 232
   goals met: 1 of 9
10. (turn_to satellite0 planet7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 34.3 to 26.888, (fuel-used) from 126.64 to 134.052
   goals met: 1 of 9
11. (turn_to satellite0 star0 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 26.888 to 19.131, (fuel-used) from 134.052 to 141.809
   goals met: 1 of 9
12. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 1 of 9
13. (turn_to satellite1 star0 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 113.06 to 94.12, (fuel-used) from 141.809 to 160.749
   goals met: 1 of 9
14. (turn_to satellite0 phenomenon6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 19.131 to 0.191, (fuel-used) from 160.749 to 179.689
   goals met: 1 of 9
15. (turn_to satellite2 star1 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star1)
   changed: (fuel satellite2) from 194 to 138.22, (fuel-used) from 179.689 to 235.469
   goals met: 1 of 9
16. (turn_to satellite1 star4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star4)
   changed: (fuel satellite1) from 94.12 to 92.308, (fuel-used) from 235.469 to 237.281
   goals met: 1 of 9
17. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 1 of 9
18. (calibrate satellite2 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 1 of 9
19. (turn_to satellite2 star12 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 star12)
   changed: (fuel satellite2) from 138.22 to 128.91, (fuel-used) from 237.281 to 246.591
   goals met: 1 of 9
20. (turn_to satellite2 star0 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 128.91 to 86.13, (fuel-used) from 246.591 to 289.371
   goals met: 1 of 9
21. (turn_to satellite2 planet7 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet7)
   changed: (fuel satellite2) from 86.13 to 78.373, (fuel-used) from 289.371 to 297.128
   goals met: 1 of 9
22. (take_image satellite2 planet7 instrument6 image0)
   added: (have_image planet7 image0)
   changed: (data_capacity satellite2) from 1000 to 993, (data-stored) from 232 to 239
   goals met: 2 of 9
23. (turn_to satellite2 star0 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 78.373 to 70.616, (fuel-used) from 297.128 to 304.885
   goals met: 2 of 9
24. (turn_to satellite2 star4 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star4)
   changed: (fuel satellite2) from 70.616 to 68.804, (fuel-used) from 304.885 to 306.697
   goals met: 2 of 9
25. (turn_to satellite2 star12 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star12)
   changed: (fuel satellite2) from 68.804 to 61.193, (fuel-used) from 306.697 to 314.308
   goals met: 2 of 9
26. (take_image satellite2 star12 instrument6 infrared1)
   added: (have_image star12 infrared1)
   changed: (data_capacity satellite2) from 993 to 879, (data-stored) from 239 to 353
   goals met: 3 of 9
27. (turn_to satellite2 star4 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star4)
   changed: (fuel satellite2) from 61.193 to 53.582, (fuel-used) from 314.308 to 321.919
   goals met: 3 of 9
28. (turn_to satellite2 star0 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 53.582 to 51.77, (fuel-used) from 321.919 to 323.731
   goals met: 3 of 9
29. (turn_to satellite2 planet5 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 51.77 to 49.258, (fuel-used) from 323.731 to 326.243
   goals met: 3 of 9
30. (take_image satellite2 planet5 instrument6 infrared1)
   added: (have_image planet5 infrared1)
   changed: (data_capacity satellite2) from 879 to 736, (data-stored) from 353 to 496
   goals met: 4 of 9
31. (turn_to satellite2 star3 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 49.258 to 41.502, (fuel-used) from 326.243 to 333.999
   goals met: 4 of 9
32. (take_image satellite2 star3 instrument6 infrared1)
   added: (have_image star3 infrared1)
   changed: (data_capacity satellite2) from 736 to 713, (data-stored) from 496 to 519
   goals met: 5 of 9
33. (turn_to satellite2 phenomenon8 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon8)
   changed: (fuel satellite2) from 41.502 to 35.82, (fuel-used) from 333.999 to 339.681
   goals met: 5 of 9
34. (take_image satellite2 phenomenon8 instrument6 infrared1)
   added: (have_image phenomenon8 infrared1)
   changed: (data_capacity satellite2) from 713 to 473, (data-stored) from 519 to 759
   goals met: 6 of 9
35. (turn_to satellite2 phenomenon11 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon11)
   changed: (fuel satellite2) from 35.82 to 4.97, (fuel-used) from 339.681 to 370.531
   goals met: 6 of 9
36. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 6 of 9
37. (turn_to satellite1 star0 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 92.308 to 90.496, (fuel-used) from 370.531 to 372.343
   goals met: 6 of 9
38. (turn_to satellite1 star4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star4)
   changed: (fuel satellite1) from 90.496 to 88.684, (fuel-used) from 372.343 to 374.155
   goals met: 6 of 9
39. (turn_to satellite1 star0 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 88.684 to 86.872, (fuel-used) from 374.155 to 375.967
   goals met: 6 of 9
40. (turn_to satellite1 star4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star4)
   changed: (fuel satellite1) from 86.872 to 85.06, (fuel-used) from 375.967 to 377.779
   goals met: 6 of 9
41. (turn_to satellite1 star0 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 85.06 to 83.248, (fuel-used) from 377.779 to 379.591
   goals met: 6 of 9
42. (calibrate satellite1 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 6 of 9
43. (turn_to satellite1 star4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star4)
   changed: (fuel satellite1) from 83.248 to 81.436, (fuel-used) from 379.591 to 381.403
   goals met: 6 of 9
44. (take_image satellite1 star4 instrument4 infrared3)
   added: (have_image star4 infrared3)
   changed: (data_capacity satellite1) from 1000 to 903, (data-stored) from 759 to 856
   goals met: 7 of 9
45. (switch_on instrument0 satellite0)
   deleted: (calibrated instrument0) (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 7 of 9
46. (turn_to satellite1 phenomenon6 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon6)
   changed: (fuel satellite1) from 81.436 to 50.896, (fuel-used) from 381.403 to 411.943
   goals met: 7 of 9
47. (take_image satellite1 phenomenon6 instrument4 image0)
   added: (have_image phenomenon6 image0)
   changed: (data_capacity satellite1) from 903 to 780, (data-stored) from 856 to 979
   goals met: 8 of 9
48. (take_image satellite2 phenomenon11 instrument6 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   changed: (data_capacity satellite2) from 473 to 182, (data-stored) from 979 to 1270
   goals met: 9 of 9
